### Restart and run all

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
from sqlalchemy import create_engine
from datetime import date, timedelta
import calendar

engine = create_engine("sqlite:///c:\\ruby\\expense\\db\\development.sqlite3")
conep = engine.connect()

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

format_dict = {'amount':'{:,}','y_amt':'{:,}','yoy_gain':'{:,}',
               'q_amt_c':'{:,}','q_amt_p':'{:,}',
               'aq_amt':'{:,}','ay_amt':'{:,}','acc_gain':'{:,}',
               'latest_amt':'{:,}','previous_amt':'{:,}','inc_amt':'{:,}',
               'latest_amt_q':'{:,}','previous_amt_q':'{:,}','inc_amt_q':'{:,}',
               'latest_amt_y':'{:,}','previous_amt_y':'{:,}','inc_amt_y':'{:,}',
               'inc_pct':'{:.2f}','inc_pct_q':'{:.2f}','inc_pct_y':'{:.2f}'}
year = 2023
month = 1
today = date.today()
today

datetime.date(2023, 1, 9)

In [2]:
sql = """
SELECT date, amount, C.name AS item, G.name AS kind, strftime("%m", date) as Month 
FROM transactions T 
JOIN categories C ON category_id = C.id 
JOIN groups G ON group_id = G.id 
WHERE strftime('%Y', date) = '2023'
"""
#sql = sql % year
print(sql)

SELECT date, amount, C.name AS item, G.name AS kind, strftime("%m", date) as Month
FROM transactions T
JOIN categories C ON category_id = C.id
JOIN groups G ON group_id = G.id
WHERE strftime('%Y', date) = '2023'

In [3]:
df_t = pd.read_sql(sql, conep)
df_t.style.format(format_dict)

In [4]:
float_formatter = "฿{:,.2f}"
ttl_exp = df_t.amount.sum()
float_formatter.format(ttl_exp)

'฿34,710.00'

In [5]:
sql = '''
SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month, 
       YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
       sells.price AS sell_price, buys.price AS buy_price,
       (sells.price - buys.price) AS diff, 
       qty, (sells.price * qty) AS sell_amt, (buys.price * qty) AS buy_amt, 
       (sells.price - buys.price) * qty AS gross, 
       ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit AS net, 
       buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE YEAR(sells.date) = %s
ORDER BY sells.date DESC, name'''
sql = sql % year
sells_df = pd.read_sql(sql, conpf)
print(sql)

SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,
       YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
       sells.price AS sell_price, buys.price AS buy_price,
       (sells.price - buys.price) AS diff,
       qty, (sells.price * qty) AS sell_amt, (buys.price * qty) AS buy_amt,
       (sells.price - buys.price) * qty AS gross,
       ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit AS net,
       buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE YEAR(sells.date) = 2023
ORDER BY sells.date DESC, name

In [6]:
sells_df.style.format(format_dict)

In [7]:
sells_df.groupby(['name'])[['gross','net']].sum()

         gross      net
name
GFPT    4500.0  4074.74
JMART   6000.0  5455.13
SINGER  6300.0  5847.49

In [8]:
float_formatter = "฿{:,.2f}"
ttl_net = sells_df.net.sum()
float_formatter.format(ttl_net)

'฿15,377.36'

In [9]:
net_flow = ttl_net - ttl_exp
ary = [ttl_net, ttl_exp, net_flow]
ary

[15377.359999999999, 34710, -19332.64]